app/controllers/locations_controller.rb

  def index
    @map = Cartographer::Gmap.new( 'map' )
    @map.zoom = :bound
    @icon = Cartographer::Gicon.new()
    @map.icons <<  @icon
    marker1 = Cartographer::Gmarker.new(:name=> "taj_mahal", :marker_type => "Building",:position => [27.173006,78.042086],:info_window_url => "/locations/1", :icon => @icon)
    marker2 = Cartographer::Gmarker.new(:name=> "raj_bhawan", :marker_type => "Building",:position => [28.614309,77.201353],:info_window_url => "/locations/2", :icon => @icon)

    @map.markers << marker1
    @map.markers << marker2

    @locations = Location.all
---
SELECT * FROM "locations"

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 2)

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 2)